Terraform plan result:

```
aws_iam_role.appsync_lambda_role: Refreshing state... [id=appsync-lambda-invoke-role]
aws_cloudwatch_log_group.presigned_url_generator_logs: Refreshing state... [id=/aws/lambda/emenu-presigned-url-generator-dev]
data.aws_s3_bucket.lambda_code: Reading...
aws_ssm_parameter.db_connect_string_param: Refreshing state... [id=/emenu/dev/db_connection_string]
aws_iam_role.lambda_exec: Refreshing state... [id=emenu_lambda_exec_role]
aws_s3_bucket.dish_images: Refreshing state... [id=emenu-dish-images-dev]
aws_iam_role.cognito_trigger: Refreshing state... [id=emenu_cognito_post_confirmation_role]
aws_cloudwatch_log_group.image_processor_logs: Refreshing state... [id=/aws/lambda/emenu-image-processor-dev]
aws_iam_role.image_processor_role: Refreshing state... [id=image-processor-role-dev]
aws_s3_bucket.restaurant_assets: Refreshing state... [id=emenu-restaurant-assets-dev]
aws_iam_role.presigned_url_role: Refreshing state... [id=presigned-url-role-dev]
aws_iam_role_policy_attachment.cognito_lambda_execution: Refreshing state... [id=emenu_cognito_post_confirmation_role-20250929095628385500000001]
aws_iam_role_policy.emenu_server_ses_access: Refreshing state... [id=emenu_lambda_exec_role:emenu_server_ses_access]
aws_iam_role_policy_attachment.lambda_basic_execution: Refreshing state... [id=emenu_lambda_exec_role-20250929095628385500000002]
data.aws_s3_bucket.lambda_code: Read complete after 1s [id=emenu-lambda-code-bucket]
data.aws_s3_object.image_processor_code: Reading...
data.aws_s3_object.presigned_url_generator_code: Reading...
data.aws_s3_object.layer_code: Reading...
data.aws_s3_object.emenu_post_confirmation_code: Reading...
data.aws_s3_object.emenu_server_code: Reading...
aws_iam_role_policy.emenu_server_ssm_access: Refreshing state... [id=emenu_lambda_exec_role:emenu_server_ssm_access]
aws_iam_role_policy.emenu_post_confirmation_ssm_access: Refreshing state... [id=emenu_cognito_post_confirmation_role:emenu_post_confirmation_ssm_access]
data.aws_s3_object.presigned_url_generator_code: Read complete after 0s [id=emenu-lambda-code-bucket/lambdas/presigned_url_generator/presigned_url_generator.zip]
data.aws_s3_object.layer_code: Read complete after 0s [id=emenu-lambda-code-bucket/layers/common_models/common_models_layer.zip]
aws_lambda_layer_version.common_mongoose_models: Refreshing state... [id=arn:aws:lambda:ap-southeast-2:205930647566:layer:common-mongoose-models:36]
data.aws_s3_object.emenu_post_confirmation_code: Read complete after 0s [id=emenu-lambda-code-bucket/lambdas/emenu_post_confirmation/emenu_post_confirmation.zip]
data.aws_s3_object.image_processor_code: Read complete after 1s [id=emenu-lambda-code-bucket/lambdas/image_processor/image_processor.zip]
data.aws_s3_object.emenu_server_code: Read complete after 1s [id=emenu-lambda-code-bucket/lambdas/emenu_server/emenu_server.zip]
aws_lambda_function.emenu_post_confirmation: Refreshing state... [id=emenu_post_confirmation]
aws_cognito_user_pool.emenu_user_pool: Refreshing state... [id=ap-southeast-2_Mw4J3zNoQ]
aws_s3_bucket_public_access_block.restaurant_assets_pab: Refreshing state... [id=emenu-restaurant-assets-dev]
aws_s3_bucket_server_side_encryption_configuration.restaurant_assets_encryption: Refreshing state... [id=emenu-restaurant-assets-dev]
aws_s3_bucket_versioning.restaurant_assets_versioning: Refreshing state... [id=emenu-restaurant-assets-dev]
aws_s3_bucket_cors_configuration.restaurant_assets_cors: Refreshing state... [id=emenu-restaurant-assets-dev]
aws_s3_bucket_public_access_block.dish_images_pab: Refreshing state... [id=emenu-dish-images-dev]
aws_iam_role_policy.image_processor_policy: Refreshing state... [id=image-processor-role-dev:image-processor-policy-dev]
aws_s3_bucket_versioning.dish_images_versioning: Refreshing state... [id=emenu-dish-images-dev]
aws_s3_bucket_server_side_encryption_configuration.dish_images_encryption: Refreshing state... [id=emenu-dish-images-dev]
aws_s3_bucket_cors_configuration.dish_images_cors: Refreshing state... [id=emenu-dish-images-dev]
aws_iam_role_policy.presigned_url_policy: Refreshing state... [id=presigned-url-role-dev:presigned-url-policy-dev]
aws_lambda_function.image_processor: Refreshing state... [id=emenu-image-processor-dev]
aws_lambda_function.presigned_url_generator: Refreshing state... [id=emenu-presigned-url-generator-dev]
aws_s3_bucket_policy.restaurant_assets_policy: Refreshing state... [id=emenu-restaurant-assets-dev]
aws_s3_bucket_policy.dish_images_policy: Refreshing state... [id=emenu-dish-images-dev]
aws_iam_role_policy.emenu_server_cognito_admin_access: Refreshing state... [id=emenu_lambda_exec_role:emenu_server_cognito_admin_access]
aws_cognito_user_pool_client.emenu_app_client: Refreshing state... [id=19kbapekjfmn2jkue74baferh5]
aws_cognito_user_group.boss_group: Refreshing state... [id=ap-southeast-2_Mw4J3zNoQ/boss]
aws_lambda_permission.allow_cognito_user_pool: Refreshing state... [id=AllowExecutionFromCognitoUserPool]
aws_iam_role_policy.cognito_admin_group_access: Refreshing state... [id=emenu_cognito_post_confirmation_role:AllowCognitoAdminGroupAccess]
aws_appsync_graphql_api.emenu_apis: Refreshing state... [id=lwxrbthg3naonl3t7x5bydvhhy]
aws_cognito_user_group.demo_group: Refreshing state... [id=ap-southeast-2_Mw4J3zNoQ/demo]
aws_cognito_user_group.waiter_group: Refreshing state... [id=ap-southeast-2_Mw4J3zNoQ/waiter]
aws_lambda_function.emenu_server: Refreshing state... [id=emenu-server]
aws_cognito_user_pool_client.emenu_web_client: Refreshing state... [id=4l90vqi7nfam318ci1tml91j3n]
aws_lambda_permission.allow_s3_invoke: Refreshing state... [id=AllowExecutionFromS3Bucket]
aws_lambda_permission.allow_s3_invoke_dish_images: Refreshing state... [id=AllowExecutionFromDishImagesBucket]
aws_lambda_function_url.presigned_url_generator: Refreshing state... [id=emenu-presigned-url-generator-dev]
aws_s3_bucket_notification.image_upload_notification: Refreshing state... [id=emenu-restaurant-assets-dev]
aws_s3_bucket_notification.dish_image_upload_notification: Refreshing state... [id=emenu-dish-images-dev]
aws_appsync_api_key.emenu_api_key: Refreshing state... [id=lwxrbthg3naonl3t7x5bydvhhy:da2-kzjdep4tsven7m6ovs5e746mp4]
aws_iam_role_policy.appsync_invoke_lambda: Refreshing state... [id=appsync-lambda-invoke-role:appsync-invoke-lambda]
aws_appsync_datasource.emenu_datasource: Refreshing state... [id=lwxrbthg3naonl3t7x5bydvhhy-emenu_datasource]
aws_appsync_resolver.list_orders_query: Refreshing state... [id=lwxrbthg3naonl3t7x5bydvhhy-Query-listOrders]
aws_appsync_resolver.get_user_by_cognito_query: Refreshing state... [id=lwxrbthg3naonl3t7x5bydvhhy-Query-getUserByCognito]
aws_appsync_resolver.delete_dish_type_mutation: Refreshing state... [id=lwxrbthg3naonl3t7x5bydvhhy-Mutation-deleteDishType]
aws_appsync_resolver.list_dishes_query: Refreshing state... [id=lwxrbthg3naonl3t7x5bydvhhy-Query-listDishes]
aws_appsync_resolver.delete_dish_mutation: Refreshing state... [id=lwxrbthg3naonl3t7x5bydvhhy-Mutation-deleteDish]
aws_appsync_resolver.get_user_query: Refreshing state... [id=lwxrbthg3naonl3t7x5bydvhhy-Query-getUser]
aws_appsync_resolver.dish_dishType_field: Refreshing state... [id=lwxrbthg3naonl3t7x5bydvhhy-Dish-dishType]
aws_appsync_resolver.get_restaurant_query: Refreshing state... [id=lwxrbthg3naonl3t7x5bydvhhy-Query-getRestaurant]
aws_appsync_resolver.checkout_order_mutation: Refreshing state... [id=lwxrbthg3naonl3t7x5bydvhhy-Mutation-checkoutOrder]
aws_appsync_resolver.invite_waiter_mutation: Refreshing state... [id=lwxrbthg3naonl3t7x5bydvhhy-Mutation-inviteWaiter]
aws_appsync_resolver.place_order_mutation: Refreshing state... [id=lwxrbthg3naonl3t7x5bydvhhy-Mutation-placeOrder]
aws_appsync_resolver.register_waiter_mutation: Refreshing state... [id=lwxrbthg3naonl3t7x5bydvhhy-Mutation-registerWaiter]
aws_appsync_resolver.create_dish_type_mutation: Refreshing state... [id=lwxrbthg3naonl3t7x5bydvhhy-Mutation-createDishType]
aws_appsync_resolver.update_dish_type_mutation: Refreshing state... [id=lwxrbthg3naonl3t7x5bydvhhy-Mutation-updateDishType]
aws_appsync_resolver.update_order_status_mutation: Refreshing state... [id=lwxrbthg3naonl3t7x5bydvhhy-Mutation-updateOrderStatus]
aws_appsync_resolver.create_restaurant_mutation: Refreshing state... [id=lwxrbthg3naonl3t7x5bydvhhy-Mutation-createRestaurant]
aws_appsync_resolver.toggle_dish_status_mutation: Refreshing state... [id=lwxrbthg3naonl3t7x5bydvhhy-Mutation-toggleDishStatus]
aws_appsync_resolver.update_restaurant_subscription_plan_mutation: Refreshing state... [id=lwxrbthg3naonl3t7x5bydvhhy-Mutation-updateRestaurantSubscriptionPlan]
aws_appsync_resolver.update_restaurant_info_mutation: Refreshing state... [id=lwxrbthg3naonl3t7x5bydvhhy-Mutation-updateRestaurantInfo]
aws_appsync_resolver.list_dish_types_query: Refreshing state... [id=lwxrbthg3naonl3t7x5bydvhhy-Query-listDishTypes]
aws_appsync_resolver.list_waiters_query: Refreshing state... [id=lwxrbthg3naonl3t7x5bydvhhy-Query-listWaiters]
aws_appsync_resolver.create_dish_mutation: Refreshing state... [id=lwxrbthg3naonl3t7x5bydvhhy-Mutation-createDish]
aws_appsync_resolver.update_dish_mutation: Refreshing state... [id=lwxrbthg3naonl3t7x5bydvhhy-Mutation-updateDish]
aws_appsync_resolver.toggle_dish_type_status_mutation: Refreshing state... [id=lwxrbthg3naonl3t7x5bydvhhy-Mutation-toggleDishTypeStatus]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  ~ update in-place
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # aws_appsync_api_key.emenu_api_key will be updated in-place
  ~ resource "aws_appsync_api_key" "emenu_api_key" {
      ~ expires     = "2026-12-25T04:00:00Z" -> (known after apply)
        id          = "lwxrbthg3naonl3t7x5bydvhhy:da2-kzjdep4tsven7m6ovs5e746mp4"
        # (4 unchanged attributes hidden)
    }

  # aws_appsync_graphql_api.emenu_apis will be updated in-place
  ~ resource "aws_appsync_graphql_api" "emenu_apis" {
        id                            = "lwxrbthg3naonl3t7x5bydvhhy"
        name                          = "emenu-apis"
      ~ schema                        = <<-EOT
            # ====================================================================
            # ENUMS & UTILITIES
            # ====================================================================
            
            enum Role {
              boss
              waiter
            }
            
            enum SubscriptionPlan {
              BASIC
              PREMIUM
            }
            
            enum OrderStatus {
              PENDING
          -   CONFIRMED # 已确认，正在制作
          -   COMPLETED # 已完成/结账
          +   PAID
              CANCELLED
            }
            
            # ====================================================================
            # CORE ENTITY TYPES (用于读取)
            # ====================================================================
            
            # 用户 Type (用于身份和权限管理)
            type User {
              id: ID! # Mongoose _id
              cognitoId: String # Cognito Sub ID
              email: String!
              role: Role!
              restaurantId: ID # 关联的餐厅 ID (Waiter 必有)
              isDeleted: Boolean! # 软删除标记
              inviteToken: String # 仅 waiter 用户有效
              status: String # waiter registration status: 'pending', 'active', 'disabled', etc.
              createdAt: String # 用户创建时间（ISO 格式）
              updatedAt: String # 用户更新时间（ISO 格式）
            }
            
            # Waiter registration response (API Key accessible)
            type RegisterWaiterPayload @aws_api_key {
              id: ID!
              cognitoId: String
              email: String!
              role: Role!
              status: String!
              createdAt: String!
            }
            
            # 餐厅 Type (包含订阅和限额信息)
            type Restaurant {
              id: ID! # Mongoose _id
              bossId: ID!
              name: String!
              logoUrl: String
              address: String
              phone: String
              subscriptionPlan: SubscriptionPlan!
              subscriptionExpiry: String! # 到期日，ISO 格式，比如 "2025-12-31"
            
              # 业务限额字段 (从 MongoDB 动态读取)
              dishTypeLimit: Int!
              dishLimit: Int!
              waiterLimit: Int!
              
              # 关联: waiters 数组（存储 waiter 的 _id，查询时可 populate）
              waiters: [User]
            }
            
            # DishType Type
            type DishType {
              id: ID!                  # Mongoose _id
              restaurantId: ID!
              name: String!
              alias: String            # Alias/Sub-title
              sortOrder: Int           # Display order (for UI control)
              isDeleted: Boolean!      # Data control (soft delete)
              isActive: Boolean!       # Business control (active/inactive)
              createdAt: String!
              updatedAt: String!
            }
            
            # Dish Type
            type Dish {
              id: ID!                  # Mongoose _id
              restaurantId: ID!
              name: String!
              price: Int!              # By cents
              imageUrl: String
              description: String      # Dish description
              sortOrder: Int           # Display order within dishType (for menu layout)
              isActive: Boolean!    # Business control: active/available to customers
              isDeleted: Boolean!      # Data control: soft delete (preserves historical orders)
            
              createdAt: String!
              updatedAt: String!
              
              dishType: DishType!      # Relationship: DishType this dish belongs to (REQUIRED - every dish must have a valid category)
            }
            
          - # 订单行项目 Type (嵌入在 Order 中)
          + # 订单行项目 Type (用于OrderBatch中)
            type OrderItem {
          +   itemId: ID!                # Item 唯一ID
              dishId: ID!
          -   name: String! # 下单时的菜品名称 (历史快照)
          -   price: Int! # 下单时的菜品价格 (历史快照)
          +   name: String!              # Dish name at the time of order (snapshot)
          +   price: Int!                # Dish price at the time of order (snapshot)
              quantity: Int!
              notes: String
          +   status: String!            # ORDERED | CONFIRMED | CANCELLED
          +   confirmedAt: String        # 确认时间 (ISO format)
          +   cancelledAt: String        # 取消时间 (ISO format)
          +   cancelReason: String       # 取消原因
            }
            
          - # 订单 Type
          + # 订单批次 Type (代表一次送厨事件)
          + type OrderBatch {
          +   batchId: ID!               # 批次唯一ID
          +   items: [OrderItem!]!       # 该批次包含的菜品
          +   confirmedAt: String!       # 送厨时间 (ISO format)
          + }
          + 
          + # 订单 Type (简化版)
            type Order {
          -   id: ID! # Mongoose _id
          +   id: ID!                    # Mongoose _id
              restaurantId: ID!
          -   waiterId: ID! # 下单服务员的 User ID
          -   tableNumber: String!
          -   status: OrderStatus!
          -   totalAmount: Int!
          -   createdAt: String!
          +   waiterId: ID!              # 下单服务员的 User ID
          +   tableNumber: String!       # 桌号
              
          -   # 嵌入列表: 订单包含的行项目
          -   items: [OrderItem!] 
          +   # 分餐信息
          +   dinerId: String            # "0" (整桌) / "1" / "2" / "3" (Diner number)
          +   tabId: String              # "default" / "tab-1" / "tab-2" (Tab ID)
          +   
          +   # 核心数据：已确认的批次
          +   batches: [OrderBatch!]!    # 多次送厨形成的批次数组
          +   
          +   # 金额信息
          +   totalConfirmedAmount: Int! # 已送厨菜品的总金额 (in cents)
          +   paidAmount: Int            # 已支付金额 (in cents)
          +   
          +   # 订单状态
          +   status: OrderStatus!       # PENDING / PAID / CANCELLED
          +   
          +   # 其他信息
          +   isFromCustomerScan: Boolean # Whether the order is from customer scan
          +   scannedAt: String          # Customer scan time
          +   paidAt: String             # Payment time
          +   createdAt: String!
          +   updatedAt: String!
            }
            
          + # 分餐者信息 Type
          + type DinerInfo {
          +   dinerId: String!           # "0" / "1" / "2" / "3"
          +   tabId: String!             # "default" / "tab-1" / "tab-2"
          +   confirmedAmount: Int!      # 该分餐者已送厨的总金额
          +   batches: [OrderBatch!]!    # 该分餐者的批次列表
          + }
          + 
          + # 桌台状态 Type (用于前端展示表格卡片信息)
          + type TableStatus {
          +   tableNumber: String!       # 桌号
          +   activeOrders: [Order!]!    # 该桌未支付的所有订单
          +   totalConfirmedAmount: Int! # 该桌已送厨的总金额 (所有diner汇总)
          +   diners: [DinerInfo!]!      # 各分餐者的明细信息
          + }
          + 
            # ====================================================================
            # INPUT TYPES (用于写入/更新)
            # ====================================================================
            
            input RestaurantInput {
              name: String!
              logoUrl: String
              address: String
              phone: String
            }
            
            input RestaurantInfoInput {
              name: String
              logoUrl: String
              address: String
              phone: String
            }
            
            input SubscriptionUpgradeInput {
              subscriptionPlan: SubscriptionPlan!
              subscriptionExpiry: String! # 到期日期
              paymentTransactionId: String # 支付交易ID，用于记录
            }
            
            input DishTypeInput {
              name: String!
              alias: String
              sortOrder: Int
            }
            
            input DishInput {
              dishTypeId: ID!          # 必须指定分类
              name: String!
              price: Int!
              imageUrl: String
              description: String
              sortOrder: Int           # 可选，默认追加到末尾
              isActive: Boolean        # 默认为 true
            }
            
            input OrderItemInput {
              dishId: ID!
              quantity: Int!
              notes: String
            }
            
          - input OrderInput {
          -   tableNumber: String!
          -   items: [OrderItemInput!]!
          + input ConfirmOrderItemsInput {
          +   tableNumber: String!           # 桌号
          +   dinerId: String!               # "0" (整桌或第一人) / "1" / "2" / "3"...
          +   tabId: String!                 # "tab-0" / "tab-1" / "tab-2"...
          +   items: [OrderItemInput!]!      # 要送厨的菜品
          +   isFromCustomerScan: Boolean    # 是否来自顾客扫码 (默认 false)
            }
            
            # ====================================================================
            # ROOT OPERATIONS
            # ====================================================================
            
            type Query {
              getUser(id: ID!): User
              getUserByCognito(cid: ID!): User
              # 菜单查询 (Boss/Waiter)
              getRestaurant: Restaurant
              listDishTypes: [DishType]
              listDishes(dishTypeId: ID): [Dish]
              listWaiters: [User]
            
              # 订单查询
              listOrders(status: OrderStatus, dateFrom: String, dateTo: String): [Order]
          +   getOrder(id: ID!): Order
          +   
          +   # 新增：桌台状态查询 (用于前端表格列表)
          +   getTableStatus(tableNumber: String!): TableStatus
            }
            
            type Mutation {
              # 餐厅与 Boss 管理
              createRestaurant(input: RestaurantInput!): Restaurant # 仅创建 BASIC 版本
              updateRestaurantInfo(input: RestaurantInfoInput!): Restaurant # 更新餐厅基本信息
              updateRestaurantSubscriptionPlan(input: SubscriptionUpgradeInput!): Restaurant # 订阅升级
              
              # invite waiter, delete waiter
              inviteWaiter(email: String!): User
              registerWaiter(token: String!, password: String!): RegisterWaiterPayload @aws_api_key # waiter registration via inviteToken (API Key access)
              deleteWaiter(id: ID!): Boolean
              activateWaiter(token: String!, password: String!): Boolean
            
              # 菜单管理
              createDishType(input: DishTypeInput!): DishType
              updateDishType(id: ID!, input: DishTypeInput!): DishType
              deleteDishType(id: ID!): DishType # 软删除，返回更新后的对象
              toggleDishTypeStatus(id: ID!, isActive: Boolean!): DishType # 切换分类状态
              
              createDish(input: DishInput!): Dish
              updateDish(id: ID!, input: DishInput!): Dish
              deleteDish(id: ID!): Dish # 软删除，返回更新后的对象
              toggleDishStatus(id: ID!, isActive: Boolean!): Dish # Switch dish availability status
            
              # 订单操作
          -   placeOrder(input: OrderInput!): Order
          -   checkoutOrder(orderId: ID!): Order
          -   updateOrderStatus(orderId: ID!, status: OrderStatus!): Order
          +   # 1. 送厨（自动创建或关联订单，形成一个batch）
          +   confirmOrderItems(input: ConfirmOrderItemsInput!): Order
          +   
          +   # 2. 继续添加菜品并送厨（可多次调用，每次形成新batch）
          +   # 使用同一个confirmOrderItems接口，根据 tableNumber + dinerId + tabId 自动关联或创建订单
          +   
          +   # 3. 取消订单中的单个菜品项
          +   cancelOrderItem(
          +     orderId: ID!,
          +     itemId: ID!,
          +     reason: String
          +   ): Order
          +   
          +   # 4. 支付订单（全额支付）
          +   payOrder(orderId: ID!): Order
          +   
          +   # 5. 取消整个订单
          +   cancelOrder(orderId: ID!): Order
            }
        EOT
        tags                          = {}
        # (11 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # aws_lambda_function.emenu_post_confirmation will be updated in-place
  ~ resource "aws_lambda_function" "emenu_post_confirmation" {
        id                             = "emenu_post_confirmation"
      ~ last_modified                  = "2025-11-19T08:47:51.000+0000" -> (known after apply)
      ~ layers                         = [
          - "arn:aws:lambda:ap-southeast-2:205930647566:layer:common-mongoose-models:36",
        ] -> (known after apply)
      ~ source_code_hash               = "50fd897321c5c888ebdb02b29a793abc" -> "ba4d0ddcd10074fd9776ade876fe1ad6"
        tags                           = {}
        # (27 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # aws_lambda_function.emenu_server will be updated in-place
  ~ resource "aws_lambda_function" "emenu_server" {
        id                             = "emenu-server"
      ~ last_modified                  = "2025-11-19T08:47:57.000+0000" -> (known after apply)
      ~ layers                         = [
          - "arn:aws:lambda:ap-southeast-2:205930647566:layer:common-mongoose-models:36",
        ] -> (known after apply)
      ~ source_code_hash               = "f8f8a1eba948f2361917cf2828d94792" -> "a23f00027e10e1a3ac0fc33e759204bb"
        tags                           = {}
        # (27 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # aws_lambda_layer_version.common_mongoose_models must be replaced
-/+ resource "aws_lambda_layer_version" "common_mongoose_models" {
      ~ arn                         = "arn:aws:lambda:ap-southeast-2:205930647566:layer:common-mongoose-models:36" -> (known after apply)
      ~ code_sha256                 = "K3n148qgIFXDM6g4kImKtY9YPbmETU5IG9yybNFnVQ4=" -> (known after apply)
      - compatible_architectures    = [] -> null
      ~ created_date                = "2025-11-19T08:47:50.535+0000" -> (known after apply)
      ~ id                          = "arn:aws:lambda:ap-southeast-2:205930647566:layer:common-mongoose-models:36" -> (known after apply)
      ~ layer_arn                   = "arn:aws:lambda:ap-southeast-2:205930647566:layer:common-mongoose-models" -> (known after apply)
      + signing_job_arn             = (known after apply)
      + signing_profile_version_arn = (known after apply)
      ~ source_code_hash            = "9d87f16c85297013c33d131ee5d3e21f" -> "26f11113263cf19211ca0e37cc6e9ff8" # forces replacement
      ~ source_code_size            = 2783557 -> (known after apply)
      ~ version                     = "36" -> (known after apply)
        # (7 unchanged attributes hidden)
    }

Plan: 1 to add, 4 to change, 1 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
Releasing state lock. This may take a few moments...
```

Please approve to proceed.
